
01 Import Libraries and Data

02 Wrangle Data

03 Perform Data Quality and Consistency Checks

04 Merge Data

01 Import Libraries and Data

In [2]:
import pandas as pd
import numpy as np
import os

In [4]:
#create path
path = r'/Users/Owner/Documents/CareerFoundry/Data Immersion/Achievement 4/01-07-2024 Instacart Basket Analysis'

In [6]:
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [8]:
#check import
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
df_cust.shape

(206209, 10)

02 Wrangle Data

In [15]:
#check column names
list(df_cust.columns)

['user_id',
 'First Name',
 'Surnam',
 'Gender',
 'STATE',
 'Age',
 'date_joined',
 'n_dependants',
 'fam_status',
 'income']

In [17]:
#rename columns, capitalization for consistency
df_cust.rename(columns = {'Surnam' : 'Last Name', 'STATE' : 'State', 'n_dependants' : 'Number_of_dependents', 'fam_status':'Marital_status', 'income': 'Income'}, inplace = True)

In [19]:
#check output
list(df_cust.columns)

['user_id',
 'First Name',
 'Last Name',
 'Gender',
 'State',
 'Age',
 'date_joined',
 'Number_of_dependents',
 'Marital_status',
 'Income']

In [23]:
#change rest of columns cap for consistency
df_cust.rename(columns = {'user_id':'User_id', 'date_joined' : 'Date_joined'}, inplace = True)

In [25]:
list(df_cust.columns)

['User_id',
 'First Name',
 'Last Name',
 'Gender',
 'State',
 'Age',
 'Date_joined',
 'Number_of_dependents',
 'Marital_status',
 'Income']

I am not dropping any columns at this stage, as I don't know which data points will be relevant to the analysis.

03 Perform Data Quality and Consistency Checks

3.1 Missing Values

In [31]:
#check for missing values
df_cust.isnull().sum()

User_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
Date_joined                 0
Number_of_dependents        0
Marital_status              0
Income                      0
dtype: int64

In [35]:
#view missing values
df_nan = df_cust[df_cust['First Name'].isnull() == True]

In [37]:
#check output
df_nan

,User_id,First Name,Last Name,Gender,State,Age,Date_joined,Number_of_dependents,Marital_status,Income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

Rationale: A missing name is unlikely to interfere with any quantitative analyses or signal an important issue. The name "Customer" indicates a null value while being a logical placeholder in qualitative reports.

In [41]:
#replace NaN values with placeholder
df_cust['First Name'].fillna('Customer', inplace=True)

/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/3612898829.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_cust['First Name'].fillna('Customer', inplace=True)

In [61]:
#check overall output
df_cust.isnull().sum()

User_id                 0
First Name              0
Last Name               0
Gender                  0
State                   0
Age                     0
Date_joined             0
Number_of_dependents    0
Marital_status          0
Income                  0
dtype: int64

In [53]:
#check output details
df_no_first = df_cust[df_cust['First Name'].str.contains('Customer')]

In [55]:
df_no_first.head()

,User_id,First Name,Last Name,Gender,State,Age,Date_joined,Number_of_dependents,Marital_status,Income
53,76659,Customer,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,Customer,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,Customer,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,Customer,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,Customer,Dawson,Female,Utah,63,1/1/2017,3,married,151819

3.2 Duplicates

In [65]:
#search for duplicates
df_dups = df_cust[df_cust.duplicated()]

In [67]:
df_dups

Empty DataFrame
Columns: [User_id, First Name, Last Name, Gender, State, Age, Date_joined, Number_of_dependents, Marital_status, Income]
Index: []

There are no duplicates in this dataset.

3.3 Mixed-Type Data

In [71]:
#check for mixed type columns
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/ys/d72m3mmn3kxcfr0s6frmm81w0000gn/T/ipykernel_1033/2421855064.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)

There are no mixed-type columns in this data set.

In [75]:
#check shape for population flow
df_cust.shape

(206209, 10)

04 Merge Data

In [77]:
#import combined dataset
df_ords_prods =  pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_aggregated.pkl'))

In [79]:
#check output
df_ords_prods.shape

(32404859, 23)

In [83]:
#check column names of aggregated dataset
list(df_ords_prods.columns)

['product_id',
 'product_name',
 'aisle_id',
 'department_id',
 'prices',
 'order_id',
 'user_id',
 'eval_set',
 'order_number',
 'order_dow',
 'order_hour_of_day',
 'days_since_prior_order',
 'add_to_cart_order',
 'reordered',
 'Busiest Days',
 'busiest_period_of_day',
 'price_range_loc',
 'max_order',
 'loyalty_flag',
 'mean_spend',
 'spending_flag',
 'buy_freq',
 'frequency_flag']

In [87]:
#revert capitalization of User_id
df_cust.rename(columns = {'User_id' : 'user_id'}, inplace = True)

In [89]:
#check output
list(df_cust.columns)

['user_id',
 'First Name',
 'Last Name',
 'Gender',
 'State',
 'Age',
 'Date_joined',
 'Number_of_dependents',
 'Marital_status',
 'Income']

In [91]:
#merge dataframes
ords_prods_cust = df_ords_prods.merge(df_cust, on = ['user_id'])

In [93]:
#check output
ords_prods_cust.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,eval_set,order_number,order_dow,...,frequency_flag,First Name,Last Name,Gender,State,Age,Date_joined,Number_of_dependents,Marital_status,Income
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,prior,28,6,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,prior,30,6,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,prior,2,0,...,Frequent customer,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,prior,1,3,...,Frequent customer,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,prior,3,4,...,Frequent customer,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308

In [95]:
ords_prods_cust.shape

(32404859, 32)

In [99]:
#Export combined dataset
ords_prods_cust.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_all.pkl'))